{"meta":{"title":"Road to Nirvana","subtitle":"Road to Nirvana","description":null,"author":"Karen Zhao","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"简述印度佛教史","slug":"Buddhism-history","date":"2017-02-16T13:18:50.940Z","updated":"2017-02-19T07:40:42.380Z","comments":true,"path":"Buddhism-history/","link":"","permalink":"http://yoursite.com/Buddhism-history/","excerpt":"写作缘起作为佛法的初学者，往往会迷惘于各种大小乘之争的论战中，对前路时长会有所怀疑；特别是互联网时代的信息爆炸以及各种网站、论坛的佛学讨论，对于洪水般的各异观点，无法判别，有时甚至会导致学佛的信心退转。 我也是此类情况。我的学佛经历相对比较曲折。最开始接触的是南传葛印卡老师的 内观禅修 ，当时对佛法一无所知；萌生了学佛之念后，因缘之下，参与了西园寺济群法师所主导的 菩提书院 ，至此，便是南传北传佛法的各种碰撞；在此过程中，又学习了台湾空海法师的 阿含解脱道次第 ，以及藏传的绿度母心咒。接触的每一个学佛团体似乎都宣说自己跟随的师傅最好，自己学的法门更殊胜，或者即使不是直接表达这个意思，也会暗示性的表示。于是乎，我糊涂了，我特别想知道在佛陀灭后，这两千多年，佛法究竟发生了什么样的变革？","text":"写作缘起作为佛法的初学者，往往会迷惘于各种大小乘之争的论战中，对前路时长会有所怀疑；特别是互联网时代的信息爆炸以及各种网站、论坛的佛学讨论，对于洪水般的各异观点，无法判别，有时甚至会导致学佛的信心退转。 我也是此类情况。我的学佛经历相对比较曲折。最开始接触的是南传葛印卡老师的 内观禅修 ，当时对佛法一无所知；萌生了学佛之念后，因缘之下，参与了西园寺济群法师所主导的 菩提书院 ，至此，便是南传北传佛法的各种碰撞；在此过程中，又学习了台湾空海法师的 阿含解脱道次第 ，以及藏传的绿度母心咒。接触的每一个学佛团体似乎都宣说自己跟随的师傅最好，自己学的法门更殊胜，或者即使不是直接表达这个意思，也会暗示性的表示。于是乎，我糊涂了，我特别想知道在佛陀灭后，这两千多年，佛法究竟发生了什么样的变革？ 摒除大小乘之争外，究竟哪些法是究竟法、哪些法是方便法？究竟我要学习哪些？ 我要如何修行才能真正的解脱苦？ 这就是我在写这边文章之前的心路历程，我希望通过对佛教史的了解，解除一些疑惑，比如“为什么佛教是无神论，而当今僧团却又十分强调 信仰 的原因？”；“为什么会出现不同的法门，这些法门的出现和当时的历史政治背景有联系吗？” 对于这个问题，我将分为两篇文章分别叙述印度佛教史和中国佛教史，关于印度佛教史，主要参照了吕澂先生的《印度佛学源流略讲》一书，做总结；关于中国佛教史，等我有时间，会补上。 特别注意一点 ：南传佛教始于阿育王时期的传法，而后在斯里兰卡、缅甸等地区，学说相对独立，和后期印度的小乘佛教并不是完全一样，后期印度的小乘佛教经历了很多变化与发展，而南传佛教则相对原始。所以本文的小乘主要讨论的是在印度的流变过程。 印度佛教史简述1.佛陀年代 印度的历史一直是世界历史中的一个迷，在于古代印度人并不喜欢用文字记述历史，所以早期的佛教史也是很难准确的衡量，包括佛陀涅槃的年份。本文沿用吕先生考证的佛灭年份，公元前486年（佛陀80岁）。佛陀29岁出家，35岁菩提树下悟道，建立一个团体（非宗教团体），讲法45年，并没有留下任何文书版的经论，传法皆是口传，后世所传经律实为佛弟子结集而成。 以下各阶段年份计算也以公元前486为基准 2.原始佛学 时间：公元前530年到公元前370年 原始佛学时期主要指**佛本人及其三四代”后传承的学说历时时期。这段时间，佛教内部尚未分裂，思想基本是一致的。 主要经典： 经：阿含经（南传名为“尼柯耶”），北传阿含和南传阿含在内容上有差别。阿含的编辑，大约在佛灭后百年间形成。 汉传阿含经：《长阿含》、《中阿含》、《杂阿含》、《增一阿含》、《杂藏》，汉文记载 南传阿含经：《长部》、《中部》、《响应部》、《增支》、《小部》，巴利文记载 其中，南传阿含是毫无遗漏而完整地传承下来，而汉译阿含则中的每一阿含经都分属不同的部派，在后代整理过程中合称四阿含，彼此之间并不像巴利文经藏如此统一与密切相关了。 3.部派佛学 时间：公元前370年到公元后150年 佛陀灭后百年后，佛教团体出现了明显的分裂，从此段时间到大乘佛教开始兴起的五百年间，成为部派佛学。这段时间，宗教色彩极浓，与婆罗门教性质差不多。 部派分裂过程： 第一次分裂 ：由于对于“钱”这个戒律的不同认知，产生了第一次结集，也叫做“大结集”，从此开始正式分裂为上座部和大众部。根据吕先生的说法，第一次分裂的主要原因其实是对佛陀本人看法的分歧，包括（1）对于“依法不依人”与愈发浓烈的宗教依佛的看法的不同；（2）上座部对于佛说采取分别说的态度；而大众部则主张“一说”的态度，认为对佛说要全部肯定。 阿育王时期（公元前360年到公元前230年前后），派遣上座部宣扬佛教，到达缅甸、北印度、大夏、斯里兰卡等地区。 第二次分裂 ：起于犊子和化地之争，争论的额内容是佛教理论是否承认补特伽罗（众生）的问题。犊子分为四部：正量、贤胄、法上和密林山；化地分为说一切有部、法藏部、雪山部、案达部。 到公元六世纪，这些部派归为四大系统：上座部、正量部、大众部、说一切有部。 4.初期大乘佛学 佛学发展到大乘阶段，学说发生了部分的质变。大乘思想发生的年代与大乘经相伴而来。中国基本上是一开始翻译佛经，便有了大乘佛经。印度的大城佛经流行大约在一世纪。有了大乘经，就有了大乘思想，随之而来有大乘学者，即龙树极其弟子们。龙树是大乘学说的创始人。 时间：公元一世纪中叶到公元四世纪。大乘学说是从部派佛学发展而来，大乘佛说吸收了各部派的特点独立发展，比如从大众系保留下的很多学说，和大乘思想就比较接近。大乘思想就是菩萨乘思想。 大乘思想分类： 基本可以分为般若和净土思想 主要经典：《大乘经》、《般若经》、《宝积经》、《法华经》、《华严经》、《维摩经》等；龙树所著《菩提资粮论》《中论》等；龙树的门人提婆所著《广百论》、《百论》等。 其中法华认为小乘是佛的权宜之计，只有大乘支才是最真实的；维摩竭力宣传小乘如何不到家而大乘解脱法门如何殊胜。 与此同时，还有一类关于信仰的经典出现，可以说是净土思想的孵化。比如说《阿閦佛经》、《阿弥陀佛经》、《般若三昧》等。 5.小乘佛学 小乘一名，是大乘盛行后对部派佛学的贬称。部派佛学并不接受，但是由于后来文献应用开了，所以习以为常，并不做贬义理解。 在大乘学说流行之后，部派佛学还在继续，但是由于受各方学说包括大乘的影响，学说有所改变，进入了一个新的发展阶段。 时间：上接部派佛学，从公元150年到五世纪终了，算是小乘的构成时期，这个时期小乘的部派包括有部、经部、正量部。 主要经典：《大毗婆娑论》、《杂阿毗昙心论》、《俱舍论》、《顺正理论》、《成实论》等。 6.中期大乘佛学 中期大乘佛学是大乘佛学的极盛时期。 时间：上接大乘佛学，约第五六世纪之间，总共有两百年的光景。玄奘是此时去求法。 主要经典：《大涅槃经》、《大法鼓经》、《如来藏经》、《菩萨藏经》、《菩萨地》、《大乘阿毗达摩经》、《解深密经》、《瑜伽师地论》等 流派 ：组织中期大乘学说的主要学者是无著、世亲；他们的学说也是后来瑜伽学派的主要观点；同时也算是唯识说的起源。 在无著和世亲以后，大乘内部有了鲜明的对立，主要有两派：瑜伽行派和中观派； 瑜伽行派：是从无著和世亲的系统下来的，主要的经典是《瑜伽师地论》，该派偏唯心； 中观派：佛护、清辩标榜恢复龙树、提婆的学说，创立了中观学派，该派偏唯物。 7.晚期大乘佛学 中期大乘佛学晚期，流行思辨繁琐学风，脱离群众，渐渐衰颓，在此基础上，密教缘起，而密教终究是和印度教的精神合流的。 时间： 第七世纪前后到十二世纪末佛教在印度消灭。在第十世纪前还有比较纯粹的大乘思想，在之后，大乘佛法成为密教的附庸。 密教产生的原因：需要结合当时的历史因素，当时由婆罗门教发展而来的印度教逐渐变成一佛崇拜，主要方法是供养、持咒、念诵；而这个时期的大乘佛教，由于理论的繁琐不被群众接受，所以为了争取群众，采取了印度的方法，这就是密教产生的原因。 其实佛教从佛陀年代开始的一系列发展都要结合当时的历史政治因素来考量，每一步发展都是契合当时的环境发展的。 总结 吕先生的这本印度佛教史概述，是一本好书，不仅对于历史做了很深入的考证；除此之外，我们也可以看到，吕先生对于佛法知识的了解是很深入的，并不是仅停留在表面。 其实，在我准备阅读之前，是受到一些同修的反对的。这里稍微讲一下， 团体修学佛法的好处和局限性。 好处是显而易见的，可以系统性的修学，同时会有同修的力量相互鼓励和进步；当然局限性也很多，团体修学很容易一不小心就变成派系化，同时因为对所跟随法师的“信仰”，而对其他的佛法知识 “害怕接触”，怕影响了自己对佛法的信仰。 然而我却发现，当你对佛教发展史了解后，你的视野会更宽广，同时也更容易跳出二元对立。我明白了我修行佛法的目的，是为了“解脱”，解脱“贪嗔痴”，脱离苦海，我需要用的方法就是“悲智双运”，要实际的去修行；“止观禅修”、“慈悲心”、“菩提心”都是我的工具，并不要在于这个工具是属于这个门派还是那个门派，他们都只是“指月的手指”，不是吗？ 重要的还是实修实证！！！","categories":[],"tags":[{"name":"buddha","slug":"buddha","permalink":"http://yoursite.com/tags/buddha/"}]},{"title":"程序盲的Hexo-Github建博之路，只要你想，你也可以！","slug":"my first blog","date":"2017-01-22T12:42:34.357Z","updated":"2017-02-16T13:12:29.857Z","comments":true,"path":"my first blog/","link":"","permalink":"http://yoursite.com/my first blog/","excerpt":"仅以此篇博文记录我的建博之路，总历时1.5天，参考百度、知乎、github站内求助等. 关于独立博客搭建的教程非常多，都非常的好，再加上我是的纯程序盲，除了大一学过C语言之外，就再也没有写过任何语言类的程序，所以本篇博客的主题是分享我建博的整个过程，从概念形成到具体落实建成发文，给想开博却还在纠结犹豫的朋友们参考。 1) 建博之由 研究生时曾特别喜欢刘未鹏，特别是对《暗时间》这本书尤其喜欢，对刘未鹏佩服之至，也是受其博文影响，自己也开始在新浪写文，但总是三天打鱼、两天晒网后就束之高阁了，也许是新浪博客的样式不喜欢、也许是众多的广告让我分心，毕业之后也就搁置了。前两天在知乎看到有问题谈到刘未鹏，于是找去他的博客，还是熟悉的深度与敏锐，和读者分享心得。几乎于一瞬间，我萌发了想法，我也要做个博客，分享我自己的学佛经历，把自己的学习成果和经历分享给更多的人。射手座的天性便是想做就做，于是开始百度研究之。","text":"仅以此篇博文记录我的建博之路，总历时1.5天，参考百度、知乎、github站内求助等. 关于独立博客搭建的教程非常多，都非常的好，再加上我是的纯程序盲，除了大一学过C语言之外，就再也没有写过任何语言类的程序，所以本篇博客的主题是分享我建博的整个过程，从概念形成到具体落实建成发文，给想开博却还在纠结犹豫的朋友们参考。 1) 建博之由 研究生时曾特别喜欢刘未鹏，特别是对《暗时间》这本书尤其喜欢，对刘未鹏佩服之至，也是受其博文影响，自己也开始在新浪写文，但总是三天打鱼、两天晒网后就束之高阁了，也许是新浪博客的样式不喜欢、也许是众多的广告让我分心，毕业之后也就搁置了。前两天在知乎看到有问题谈到刘未鹏，于是找去他的博客，还是熟悉的深度与敏锐，和读者分享心得。几乎于一瞬间，我萌发了想法，我也要做个博客，分享我自己的学佛经历，把自己的学习成果和经历分享给更多的人。射手座的天性便是想做就做，于是开始百度研究之。 2) 选择独立博客的域名和平台 决定要建博客，最重要的两件事，便是域名和平台。域名决定了你网站未来的访问便利性和百度的可收录性。而搭载平台决定了网站加载速度。由于不想受国内的备案和监管，因为各种各样的不确定性而使博客被关，所以我选的是国外域名网站购买域名以及搭载在github上（也是为了省每年虚拟主机的费用）。域名注册：经过对比，选择了namesilo作为注册网站，购买了.com的域名，8.99美金，可以百度找优惠券，有一美金的优惠券。Github：登陆github官网，注册账号。 3) 选择Hexo作为博客生成器 Hexo，是用node.js软件开发的博客博客生成器。通俗来讲就是利用Hexo在本地也就是你的电脑单机版中搭建网站。除了Hexo，其实也有其他的选择，但因为Hexo是知乎用户推荐最多的，所以我就选择了Hexo。 4) 参照网上教程，搭建独立博客 我选择参照了Grok《知行合一 用Hexo搭建博客》这篇博文，一步步操作，基本没问题。其中有个bug，就是我的域名解析出了问题，我的域名网站始终没有办法显示hexo的内容。这时，参照了知乎skycrown的回答，成功解决，具体解决方法可以参见skycrown的回答。这时，基本雏形已定。同时，这里要感谢litten这为鹅厂小哥的hexo theme，采用了他写的主题。 5) 撰写发布 撰写文档使用的是MarkdownEditor，这款编辑器很好用，左右分栏，可以实时看到文档。Markdown语法比较简单，我基本是上手即用。写完保存为MD格式后，通过终端运行hexo generate，hexo d-g 之后，即可在博客显示。 6) 解决百度收录问题 由于github屏蔽了百度的收录，所以我的网站并不会被百度收录。知乎看了很多来解决此问题，最后选择同时部署coding的做法。coding收购了gitcafe，其实从类型上来讲相当于国内版的github。所以在域名解析的时候，讲国外对应github，国内对应coding，即可解决问题。具体教程，我是参照了胖逆的嘟嘟的教程，简单易上手，解决百度收录这一大问题。毕竟百度还是国内第一大搜索网站，而我写的内容更多是知识分享性，希望能够使更多的朋友受益。 至此，便是我搭建独立博客的全部经历。在第4步具体搭建时，真的是遇到了很多困难，由于没有编程基础，对很多语言的语法并不了解，所以即使在照着教程写命令的时候，也会出现很多bug，有的时候可能仅仅是你少敲了空格。这时候，需要耐着性子，重新来过。一遍一遍来过，一遍一遍纠错，最终绝对可以搭建成功。 综上是我的独立博客搭建之路。不需要你是程序员、不需要你懂技术，只要你想，只要你肯努力、不断尝试，没有什么不可能。","categories":[],"tags":[{"name":"randomthoughts","slug":"randomthoughts","permalink":"http://yoursite.com/tags/randomthoughts/"}]}]}